Revit 2027 API
SpatialElementFromToCalculationPoints.FromPosition Property
 The "from" position of spatial element connecting calculation point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ FromPosition { get; set; }
Public Property FromPosition As XYZ
	Get
	Set
public:
property XYZ^ FromPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
member FromPosition : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentException |  When setting this property: fromPosition must be on the opposite side of the family's host from the "to" position.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
SpatialElementFromToCalculationPoints Class
Autodesk.Revit.DB Namespace